package com.yundao.tenant.constant.code;

/**
 * ouyangli
 *
 * @author jan
 * @create 2017-10-31 20:24
 **/
public interface Code1200000 {
	/**
	 * 调用腾讯云创建视频分类失败
	 */
	int CODE_1200169 = 1200169;

	/**
	 * 自定义的开始日期和结束日期不能为空
	 */
	int CODE_1200170 = 1200170;

	/**
	 * 请选择部门或者用户
	 */
	int CODE_1200171 = 1200171;
	/**
	 * 文件不存在
	 */
	int CODE_1200172 = 1200172;
	/**
	 * 文件ID不能为空
	 */
	int CODE_1200173 = 1200173;
	/**
	 * 文件大小不能为空
	 */
	int CODE_1200174 = 1200174;
	/**
	 * 栏目ID不能为空
	 */
	int CODE_1200175 = 1200175;
	/**
	 * 路演ID不能为空
	 */
	int CODE_1200176 = 1200176;
	/**
	 * 视频ID不能为空
	 */
	int CODE_1200177 = 1200177;

	/**
	 * 测评id不能为空
	 */
	int CODE_1200178 = 1200178;
	/**
	 * 平台code不能为空
	 */
	int CODE_1200179 = 1200179;
	/**
	 * 平台code不存在
	 */
	int CODE_1200180 = 1200180;

	/**
	 * 你不是当前客户的理财师
	 */
	int CODE_1200181 = 1200181;

	/**
	 * 测评id不存在
	 */
	int CODE_1200182 = 1200182;

	/**
	 * 该测评不是您的
	 */
	int CODE_1200183 = 1200183;

	/**
	 * 已存在相同类型并且没有完成的流程
	 */
	int CODE_1200184 = 1200184;
	/**
	 * 视频压缩失败
	 */
	int CODE_1200185 = 1200185;
	/**
	 * 有路演正在使用以下视频，不可删除
	 */
	int CODE_1200186 = 1200186;
	/**
	 * 视频不存在
	 */
	int CODE_1200187 = 1200187;

	/**
	 * 该客户没有注册
	 */
	int CODE_1200188 = 1200188;
	/**
	 * 路演栏目ID不存在
	 */
	int CODE_1200189 = 1200189;
	/**
	 * 路演ID不存在
	 */
	int CODE_1200190 = 1200190;
    /**
     * 客户录入信息不能为空
     */
    int CODE_1200193 = 1200193;
    /**
     * 发送状态不能为空
     */
    int CODE_1200194 = 1200194;
    /**
     * 短信内容必须在{min}到{max}之间
     */
    int CODE_1200195 = 1200195;
    /**
     * 称呼必须在{min}到{max}之间
     */
    int CODE_1200196 = 1200196;
    /**
     * 签名必须在{min}到{max}之间
     */
    int CODE_1200197 = 1200197;
    /**
     * 提醒时间不能为空
     */
    int CODE_1200198 = 1200198;
	/**
	 * 视频分类不能为空
	 */
	int CODE_1200200 = 1200200;
	/**
	 * 该客户不属于您所有，无法报单
	 */
	int CODE_1200201 = 1200201;
	/**
	 * 先预约再报单的产品，不需要传客户ID
	 */
	int CODE_1200202 = 1200202;
	 /**
     * 该短信数据不存在
     */
    int CODE_1200203 = 1200203;
    /**
     * 已发送的短信不可编辑
     */
    int CODE_1200204 = 1200204;
    
    /**
     * 客户数据不存在
     */
    int CODE_1200205 = 1200205;
}
