package com.yundao.tenant.constant.code;

/**
 * 提示码
 *
 * @author jan
 * @create 2017-06-22 PM3:44
 **/
public interface CodeConstant {

    /**
     * id不能为空
     */
    int CODE_1200000 = 1200000;

    /**
     * 名称不能为空
     */
    int CODE_1200001 = 1200001;

    /**
     * 名称长度必须在{min}到{max}之间
     */
    int CODE_1200002 = 1200002;

    /**
     * 该角色不存在
     */
    int CODE_1200003 = 1200003;

    /**
     * 部门不存在
     */
    int CODE_1200004 = 1200004;

    /**
     * 部门名称不能为空
     */
    int CODE_1200005 = 1200005;

    /**
     * 部门id不能为空
     */
    int CODE_1200006 = 1200006;

    /**
     * 角色id不能为空
     */
    int CODE_1200007 = 1200007;

    /**
     * 角色下有关联用户，不可删除
     */
    int CODE_1200008 = 1200008;

    /**
     * 用户名长度必须在{min}到{max}之间
     */
    int CODE_1200009 = 1200009;

    /**
     * 真实姓名长度必须在{min}到{max}之间
     */
    int CODE_1200010 = 1200010;

    /**
     * 手机号长度必须在{min}到{max}之间
     */
    int CODE_1200011 = 1200011;

    /**
     * 邮箱长度必须在{min}到{max}之间
     */
    int CODE_1200012 = 1200012;

    /**
     * 工号长度必须在{min}到{max}之间
     */
    int CODE_1200013 = 1200013;

    /**
     * 用户id不能为空
     */
    int CODE_1200014 = 1200014;
    /**
     * 旧密码错误!
     */
    int CODE_1200015 = 1200015;

    /**
     * 用户名和密码错误!
     */
    int CODE_1200016 = 1200016;

    /**
     * 登录失败，用户没有启用!
     */
    int CODE_1200017 = 1200017;

    /**
     * 用户不存在!
     */
    int CODE_1200018 = 1200018;
    /**
     * 手机号码已存在!
     */
    int CODE_1200019 = 1200019;
    /**
     * 用户名已存在!
     */
    int CODE_1200020 = 1200020;
    /**
     * 工号已存在!
     */
    int CODE_1200021 = 1200021;
    /**
     * 用户已被停用
     */
    int CODE_1200022 = 1200022;
    /**
     * 租户数据库已经初始化, 请清空数据!
     */
    int CODE_1200023 = 1200023;
    /**
     * 租户数据库表没有创建!
     */
    int CODE_1200024 = 1200024;
    /**
     * 初始化数据不完整!
     */
    int CODE_1200025 = 1200025;

    /**
     * 请选择上级部门
     */
    int CODE_1200026 = 1200026;

    /**
     * 没有找到对应的业务对象模块
     */
    int CODE_1200027 = 1200027;

    /**
     * 没有找到对应的要素
     */
    int CODE_1200028 = 1200028;

    /**
     * 属性分组已经存在
     */
    int CODE_1200029 = 1200029;

    /**
     * 业务对象编码不能为空
     */
    int CODE_1200030 = 1200030;

    /**
     * 要素名称长度必须在{min}到{max}之间
     */
    int CODE_1220001 = 1220001;

    /**
     * 单位不能为空
     */
    int CODE_1220002 = 1220002;

    /**
     * “是否必填”项不能为空
     */
    int CODE_1220003 = 1220003;

    /**
     * “是否通用”项不能为空
     */
    int CODE_1220004 = 1220004;

    /**
     * “是否启用”项不能为空
     */
    int CODE_1220005 = 1220005;

    /**
     * 请选择要素类型
     */
    int CODE_1220006 = 1220006;

    /**
     * “权限限制”项不能为空
     */
    int CODE_1220007 = 1220007;

    /**
     * “权限限制”为部分可见时，请勾选角色
     */
    int CODE_1220008 = 1220008;

    /**
     * 选项信息不能为空
     */
    int CODE_1220009 = 1220009;

    /**
     * 预置的通用要素不可删除
     */
    int CODE_1220010 = 1220010;

    /**
     * 描述长度必须在{min}到{max}之间
     */
    int CODE_1220011 = 1220011;

    /**
     * 无法找到短信模板
     */
    int CODE_1220012 = 1220012;

    /**
     * 短信内容为空
     */
    int CODE_1220013 = 1220013;

    /**
     * 数据权限内容不能为空
     */
    int CODE_1220014 = 1220014;

    /**
     * 您没有权限
     */
    int CODE_1220015 = 1220015;

    /**
     * 无权限修改
     */
    int CODE_1220016 = 1220016;

    /**
     * 编码不能为空
     */
    int CODE_1220017 = 1220017;

    /**
     * 角色名称已存在
     */
    int CODE_1220018 = 1220018;

    /**
     * 无权限对象以下数据进行删除操作
     */
    int CODE_1220019 = 1220019;

    /**
     * 无效的身份标识
     */
    int CODE_1220020 = 1220020;

    /**
     * 要素名称已存在
     */
    int CODE_1220021 = 1220021;

    /**
     * 要素不存在
     */
    int CODE_1220022 = 1220022;

    /**
     * 手机号码不能为空
     */
    int CODE_1220023 = 1220023;

    /**
     * 短信内容不能为空
     */
    int CODE_1220024 = 1220024;

    /**
     * 该用户还没有设置角色
     */
    int CODE_1220025 = 1220025;

    /**
     * 该用户没有任何资源
     */
    int CODE_1220026 = 1220026;

    /**
     * 该角色不能删除
     */
    int CODE_1220027 = 1220027;

    /**
     * 该角色不能修改
     */
    int CODE_1220028 = 1220028;

    /**
     * 该角色的权限不能修改
     */
    int CODE_1220029 = 1220029;

    /**
     * 状态有误
     */
    int CODE_1220030 = 1220030;

    /**
     * 该产品不存在
     */
    int CODE_1220031 = 1220031;

    /**
     * 该产品审核信息不存在
     */
    int CODE_1220032 = 1220032;

    /**
     * 该产品审核id不能为空
     */
    int CODE_1220033 = 1220033;

    /**
     * 任务Id不能为空
     */
    int CODE_1220034 = 1220034;

    /**
     * 无效的数据对象编码
     */
    int CODE_1220035 = 1220035;

    /**
     * 角色名称不能为空
     */
    int CODE_1220036 = 1220036;

    /**
     * 部分资源不存在
     */
    int CODE_1220037 = 1220037;

    /**
     * 产品审核状态有误
     */
    int CODE_1220038 = 1220038;

    /**
     * 该数据不允许审核
     */
    int CODE_1220039 = 1220039;

    /**
     * 产品审核状态不能为空
     */
    int CODE_1220040 = 1220040;

    /**
     * 驳回原因必须在{min}到{max}之间
     */
    int CODE_1220041 = 1220041;

    /**
     * ownerId不能为空
     */
    int CODE_1220042 = 1220042;

    /**
     * 数据对象编码不能为空
     */
    int CODE_1220043 = 1220043;

    /**
     * 操作类型不能为空
     */
    int CODE_1220044 = 1220044;

    /**
     * 请选择客户
     */
    int CODE_1220045 = 1220045;

    /**
     * 回退原因长度必须在{min}到{max}之间
     */
    int CODE_1220046 = 1220046;

    /**
     * 客户id不能为空
     */
    int CODE_1220047 = 1220047;

    /**
     * 请选择理财师
     */
    int CODE_1220048 = 1220048;

    /**
     * 请选择产品
     */
    int CODE_1220049 = 1220049;

    /**
     * 请输入预计打款日期
     */
    int CODE_1220050 = 1220050;

    /**
     * 请输入预约金额
     */
    int CODE_1220051 = 1220051;

    /**
     * 备注字数不能超过200
     */
    int CODE_1220052 = 1220052;

    /**
     * 工作流启动失败
     */
    int CODE_1220053 = 1220053;

    /**
     * 预约数据不存在
     */
    int CODE_1220054 = 1220054;

    /**
     * 状态值有误，不能进行审核操作
     */
    int CODE_1220055 = 1220055;

    /**
     * 审核失败
     */
    int CODE_1220056 = 1220056;

    /**
     * 请填写驳回原因
     */
    int CODE_1220057 = 1220057;

    /**
     * 请填写取消原因
     */
    int CODE_1220058 = 1220058;

    /**
     * 状态值不能为空
     */
    int CODE_1220059 = 1220059;

    /**
     * 驳回/取消原因字数不能超过50
     */
    int CODE_1220060 = 1220060;

    /**
     * 报单id不能为空
     */
    int CODE_1220061 = 1220061;

    /**
     * 报单数据不存在
     */
    int CODE_1220062 = 1220062;

    /**
     * 状态值有误，不能提交申请
     */
    int CODE_1220063 = 1220063;

    /**
     * 审核动作action不能为空
     */
    int CODE_1220064 = 1220064;

    /**
     * 回访时间不能为空
     */
    int CODE_1220065 = 1220065;

    /**
     * 请选择回访方式
     */
    int CODE_1220066 = 1220066;

    /**
     * 请选择回访状态
     */
    int CODE_1220067 = 1220067;

    /**
     * 请输入回访内容
     */
    int CODE_1220068 = 1220068;

    /**
     * 回访内容字数不能超过200
     */
    int CODE_1220069 = 1220069;

    /**
     * 回访数据不存在
     */
    int CODE_1220070 = 1220070;

    /**
     * 预约的产品发行状态必须是预售、募集中
     */
    int CODE_1220071 = 1220071;

    /**
     * 需要导入的数据不能为空
     */
    int CODE_1220072 = 1220072;


    /**
     * 审核已失效
     */
    int CODE_1220073 = 1220073;

    /**
     * 您不能进行此操作
     */
    int CODE_1220074 = 1220074;

    /**
     * 原因字数不能超过2000
     */
    int CODE_1220075 = 1220075;

    /**
     * 验证码有误
     */
    int CODE_1220077 = 1220077;

    /**
     * 预约金额不能为0
     */
    int CODE_1220076 = 1220076;

    /**
     * 验证码已失效
     */
    int CODE_1220078 = 1220078;

    /**
     * 客户名称不能为空
     */
    int CODE_1220079 = 1220079;

    /**
     * 手机号码不能为空
     */
    int CODE_1220080 = 1220080;

    /**
     * 线索类型不能为空
     */
    int CODE_1220081 = 1220081;

    /**
     * 线索渠道不能为空
     */
    int CODE_1220082 = 1220082;

    /**
     * 线索数据不能为空
     */
    int CODE_1220083 = 1220083;

    /**
     * 线索内容字数不能超过120
     */
    int CODE_1220084 = 1220084;

    /**
     * 预约失败
     */
    int CODE_1220085 = 1220085;

    /**
     * 线索状态不能为空
     */
    int CODE_1220086 = 1220086;

    /**
     * 线索已被处理
     */
    int CODE_1220087 = 1220087;

    /**
     * 只能处理为已联系或关闭
     */
    int CODE_1220088 = 1220088;

    /**
     * 线索id不能为空
     */
    int CODE_1220089 = 1220089;

    /**
     * 线索数据不存在
     */
    int CODE_1220090 = 1220090;

    /**
     * 线索尚未分配回访
     */
    int CODE_1220091 = 1220091;

    /**
     * 客户状态不能为空
     */
    int CODE_1220092 = 1220092;

    /**
     * 客户状态有误
     */
    int CODE_1220093 = 1220093;

    /**
     * 回访负责人不存在
     */
    int CODE_1220094 = 1220094;

    /**
     * 回访事由不能为空
     */
    int CODE_1220095 = 1220095;

    /**
     * 回访事由字数不能超过100
     */
    int CODE_1220096 = 1220096;

    /**
     * 需要回访的线索已不存在
     */
    int CODE_1220097 = 1220097;

    /**
     * 回访负责人不能为空
     */
    int CODE_1220098 = 1220098;

    /**
     * 需要分配的线索数据有误，线索所属客户与传入客户不一致
     */
    int CODE_1220099 = 1220099;

    /**
     * 存在不可被分配的线索
     */
    int CODE_1220100 = 1220100;

    /**
     * 客户已被分配
     */
    int CODE_1220101 = 1220101;

    /**
     * 该部门存在在职用户，不可删除
     */
    int CODE_1220102 = 1220102;

    /**
     * 报单有多个资料没完善
     */
    int CODE_1220103 = 1220103;

    /**
     * 没有找到指定短信模板
     */
    int CODE_1220104 = 1220104;

    /**
     * 请配置短信账号
     */
    int CODE_1220105 = 1220105;

    /**
     * 短信通道类型不能为空
     */
    int CODE_1220106 = 1220106;

    /**
     * 短信通道类型有误
     */
    int CODE_1220107 = 1220107;

    /**
     * 有报单未完成
     */
    int CODE_1220108 = 1220108;

    /**
     * 客户名下有报单未完成
     */
    int CODE_1220109 = 1220109;

    /**
     * 请上传银行卡正反面
     */
    int CODE_1220110 = 1220110;

    /**
     * tenantId 不能为空
     */
    int CODE_1220111 = 1220111;

    /**
     * userId 不能为空
     */
    int CODE_1220112 = 1220112;

    /**
     * 该客户不属于您所有，无法预约
     */
    int CODE_1220113 = 1220113;

    /**
     * 有额度预约未完成
     */
    int CODE_1220114 = 1220114;

    /**
     * 回访已被处理
     */
    int CODE_1220115 = 1220115;

    /**
     * 请输入回款计划名称
     */
    int CODE_1220116 = 1220116;

    /**
     * 回款计划名称长度不能超过30
     */
    int CODE_1220117 = 1220117;

    /**
     * 请输入回款计划金额
     */
    int CODE_1220118 = 1220118;

    /**
     * 回款单位长度不能超过50
     */
    int CODE_1220119 = 1220119;

    /**
     * 备注长度不能超过200
     */
    int CODE_1220120 = 1220120;

    /**
     * 请输入回款产品
     */
    int CODE_1220121 = 1220121;

    /**
     * 供应商不存在
     */
    int CODE_1220122 = 1220122;

    /**
     * 回款计划金额不能为负数
     */
    int CODE_1220123 = 1220123;

    /**
     * 回款计划id不能为空
     */
    int CODE_1220124 = 1220124;

    /**
     * 产品和供应商无关联关系
     */
    int CODE_1220125 = 1220125;

    /**
     * 请选择需要删除的回款计划
     */
    int CODE_1220126 = 1220126;

    /**
     * 回款计划数据不存在
     */
    int CODE_1220127 = 1220127;

    /**
     * 计划下存在回款记录
     */
    int CODE_1220128 = 1220128;

    /**
     * 回款计划不存在
     */
    int CODE_1220129 = 1220129;

    /**
     * 回款计划名称已存在
     */
    int CODE_1220130 = 1220130;

    /**
     * 回款金额不能为空
     */
    int CODE_1220131 = 1220131;

    /**
     * 回款日期不能为空
     */
    int CODE_1220132 = 1220132;

    /**
     * 回款单位长度不能超过50
     */
    int CODE_1220133 = 1220133;

    /**
     * 回款银行长度不能超过50
     */
    int CODE_1220134 = 1220134;

    /**
     * 回款账号格式有误
     */
    int CODE_1220135 = 1220135;

    /**
     * 请输入开票时间
     */
    int CODE_1220136 = 1220136;

    /**
     * 备注长度不能超过200
     */
    int CODE_1220137 = 1220137;

    /**
     * 日期格式有误
     */
    int CODE_1220138 = 1220138;

    /**
     * 请选择要删除的回款记录
     */
    int CODE_1220139 = 1220139;

    /**
     * 回款记录数据不存在
     */
    int CODE_1220140 = 1220140;

    /**
     * 文章id不能为空
     */
    int CODE_1220141 = 1220141;

    /**
     * 文章数据不存在
     */
    int CODE_1220142 = 1220142;

    /**
     * 请选择需要删除的文章
     */
    int CODE_1220143 = 1220143;

    /**
     * 回款日期不应晚于当前时间
     */
    int CODE_1220144 = 1220144;

    /**===jan end===**/

    /**
     * 同一层级，部门名称不能重复!
     */
    int CODE_1200031 = 1200031;

    /**
     * 上级部门不存在
     */
    int CODE_1200033 = 1200033;

    /**
     * 产品信息校验失败！
     */
    int CODE_1200034 = 1200034;

    /**
     * 当前用户账号不存在该租户!
     */
    int CODE_1200035 = 1200035;

    /**
     * 请选择最少一个角色
     */
    int CODE_1200036 = 1200036;

    /**
     * 您选择的上级领导不存在
     */
    int CODE_1200037 = 1200037;

    /**
     * 请选择用户
     */
    int CODE_1200038 = 1200038;
    /**
     * ticket不能为空
     */
    int CODE_1200039 = 1200039;
    /**
     * 无效ticket
     */
    int CODE_1200040 = 1200040;

    /**
     * 产品id不能为空
     */
    int CODE_1200041 = 1200041;

    /**
     * 产品不存在
     */
    int CODE_1200042 = 1200042;

    /**
     * 该产品操作有误
     */
    int CODE_1200043 = 1200043;

    /**
     * 产品类别不能为空
     */
    int CODE_1200044 = 1200044;

    /**
     * 产品类别不存在
     */
    int CODE_1200045 = 1200045;

    /**
     * 预置的超级管理员不能被停用
     */
    int CODE_1200046 = 1200046;

    /**
     * 产品附件原始文件名称不能为空
     */
    int CODE_1200047 = 1200047;

    /**
     * 产品附件url不能为空
     */
    int CODE_1200048 = 1200048;

    /**
     * 产品附件id不能为空
     */
    int CODE_1200049 = 1200049;

    /**
     * 工号不能为空
     */
    int CODE_1200050 = 1200050;

    /**
     * 用户名不能为空
     */
    int CODE_1200051 = 1200051;

    /**
     * 邮箱不能为空
     */
    int CODE_1200052 = 1200052;

    /**
     * 部门名称长度必须在{min}到{max}之间
     */
    int CODE_1200053 = 1200053;

    /**
     * 工作流返回数据有误
     */
    int CODE_1200054 = 1200054;


    /**
     * 最多添加20个供应商
     */
    int CODE_1200055 = 1200055;
    /**
     * 供应商名称长度必须在{1}到{100}之间
     */
    int CODE_1200056 = 1200056;
    /**
     * 一个供应商最多添加20条报价
     */
    int CODE_1200057 = 1200057;
    /**
     * 报价备注长度必须在{0}到{200}之间
     */
    int CODE_1200058 = 1200058;

    /**
     * 销售佣金的个数必须在{1}到{20}之间
     */
    int CODE_1200059 = 1200059;
    /**
     * 佣金规则名称长度必须在{1}到{100}之间
     */
    int CODE_1200060 = 1200060;
    /**
     * 佣金项目的个数必须在{1}到{20}之间
     */
    int CODE_1200061 = 1200061;
    /**
     * 佣金备注长度必须在{0}到{200}之间
     */
    int CODE_1200062 = 1200062;

    /**
     * 收益规则的个数必须在{1}到{20}之间
     */
    int CODE_1200063 = 1200063;
    /**
     * 收益规则名称长度必须在{1}到{100}之间
     */
    int CODE_1200064 = 1200064;
    /**
     * 每条收益规则的收益项目的个数必须在{1}到{20}之间
     */
    int CODE_1200065 = 1200065;
    /**
     * 收益备注长度必须在{0}到{200}之间
     */
    int CODE_1200066 = 1200066;

    /**
     * 每只报价的最小值不能小于0
     */
    int CODE_1200067 = 1200067;

    /**
     * 每只报价的最大值不能小于最小值
     */
    int CODE_1200068 = 1200068;

    /**
     * 只有最后一只报价的最大值可以为空
     */
    int CODE_1200069 = 1200069;

    /**
     * 下一只报价最小值必须大于上一只报价最大值
     */
    int CODE_1200070 = 1200070;

    /**
     * 每只佣金的最小值不能小于0
     */
    int CODE_1200071 = 1200071;

    /**
     * 每只佣金的最大值不能小于最小值
     */
    int CODE_1200072 = 1200072;

    /**
     * 只有最后一只佣金的最大值可以为空
     */
    int CODE_1200073 = 1200073;

    /**
     * 下一只佣金最小值必须大于上一只佣金最大值
     */
    int CODE_1200074 = 1200074;
    /**
     * 未上线的产品才可删除
     */
    int CODE_1200075 = 1200075;

    /**
     * 每只收益佣金的最小值不能小于0
     */
    int CODE_1200076 = 1200076;

    /**
     * 每只收益佣金的最大值不能小于最小值
     */
    int CODE_1200077 = 1200077;

    /**
     * 只有最后一只收益佣金的最大值可以为空
     */
    int CODE_1200078 = 1200078;

    /**
     * 下一只收益佣金最小值必须大于上一只收益佣金最大值
     */
    int CODE_1200079 = 1200079;

    /**
     * 产品附件不存在
     */
    int CODE_1200080 = 1200080;

    /**
     * 供应商报价的范围不能大于产品规模
     */
    int CODE_1200081 = 1200081;
    /**
     * 销售佣金的范围不能大于产品规模
     */
    int CODE_1200082 = 1200082;
    /**
     * 认购金额不能大于产品规模
     */
    int CODE_1200083 = 1200083;
    /**
     * 客户不存在
     */
    int CODE_1200084 = 1200084;
    /**
     * 供应商的名称不能重复
     */
    int CODE_1200086 = 1200086;

    /**
     * 佣金规则不能重复
     */
    int CODE_1200087 = 1200087;

    /**
     * 收益规则不能重复
     */
    int CODE_1200088 = 1200088;
    /**
     * 客户未分配
     */
    int CODE_1200089 = 1200089;
    /**
     * 附件类型不能为空
     */
    int CODE_1200090 = 1200090;
    /**
     * 证件类型不能为空
     */
    int CODE_1200091 = 1200091;
    /**
     * 修改失败
     */
    int CODE_1200092 = 1200092;

    /**
     * 审核中的产品不能编辑
     */
    int CODE_1200093 = 1200093;
    /**
     * 驳回/取消原因长度必须在{min}到{max}之间
     */
    int CODE_1200094 = 1200094;

    /**
     * 客户回退id不能为空
     */
    int CODE_1200095 = 1200095;


    /**
     * 客户回退id有误
     */
    int CODE_1200096 = 1200096;

    /**
     * 只有审核中的回退申请才能审批通过
     */
    int CODE_1200097 = 1200097;

    /**
     * 只有审核中的回退申请才能审批驳回
     */
    int CODE_1200098 = 1200098;

    /**
     * 请选择客服
     */
    int CODE_1200099 = 1200099;

    /**
     * 回访事由长度必须在{min}到{max}之间
     */
    int CODE_1200100 = 1200100;

    /**
     * 请选择客户
     */
    int CODE_1200101 = 1200101;

    /**
     * 预约id不能为空
     */
    int CODE_1200102 = 1200102;

    /**
     * 状态为待审核、审核通过、已取消和已作废的预约不可编辑
     */
    int CODE_1200103 = 1200103;

    /**
     * 预约不存在
     */
    int CODE_1200104 = 1200104;

    /**
     * 状态为待审核、审核通过、已取消和已作废的预约不可重新提交
     */
    int CODE_1200105 = 1200105;

    /**
     * 取消原因长度必须在{min}到{max}之间
     */
    int CODE_1200106 = 1200106;

    /**
     * 请选择产品
     */
    int CODE_1200107 = 1200107;

    /**
     * 没有找到对应的任务id
     */
    int CODE_1200108 = 1200108;
    /**
     * qq只能是数字
     */
    int CODE_1200109 = 1200109;

    /**
     * 作废原因长度必须在{min}到{max}之间
     */
    int CODE_1200110 = 1200110;

    /**
     * 找不到对应的业务key
     */
    int CODE_1200111 = 1200111;

    /**
     * 审核通过的预约才能作废
     */
    int CODE_1200112 = 1200112;
    /**
     * 审核通过的报单才能作废
     */
    int CODE_1200113 = 1200113;

    /**
     * 报单不存在
     */
    int CODE_1200114 = 1200114;

    /**
     * 该预约已经作废
     */
    int CODE_1200115 = 1200115;

    /**
     * 该报单已经作废
     */
    int CODE_1200116 = 1200116;
    /**
     * 状态为待审核和已驳回的预约才可取消
     */
    int CODE_1200117 = 1200117;

    /**
     * 分析评估配置的题目没有配置
     */
    int CODE_1200118 = 1200118;

    /**
     * 请输入选项
     */
    int CODE_1200119 = 1200119;
    /**
     * 单选题目不能选择多个
     */
    int CODE_1200120 = 1200120;

    /**
     * 选项值有误
     */
    int CODE_1200121 = 1200121;

    /**
     * 还有题目没有选择
     */
    int CODE_1200122 = 1200122;


    /**
     * 您还么有进行风险评测
     */
    int CODE_1200123 = 1200123;

    /**
     * 投资者id不能为空
     */
    int CODE_1200124 = 1200124;

    /**
     * 测评答案不能为空
     */
    int CODE_1200125 = 1200125;
    /**
     * 审核中报单不能修改
     */
    int CODE_1200126 = 1200126;
    /**
     * 已通过报单不能修改
     */
    int CODE_1200127 = 1200127;

    /**
     * 投资者id不存在
     */
    int CODE_1200128 = 1200128;
    /**
     * 预约金额不能为0
     */
    int CODE_1200129 = 1200129;
    /**
     * 预约金额不能小于起投金额
     */
    int CODE_1200130 = 1200130;
    /**
     * 预约金额不符合递增金额规则
     */
    int CODE_1200131 = 1200131;
    /**
     * 应用类型不能为空（pc或app）
     */
    int CODE_1200132 = 1200132;

    /**
     * 不存在超级管理员角色
     */
    int CODE_1200133 = 1200133;
    /**
     * QQ最大长度不能大于20
     */
    int CODE_1200134 = 1200134;

    /**
     * 该客户已经被其他人领取！
     */
    int CODE_1200135 = 1200135;

    /**
     * 您领取客户数达到上限，不能领取
     */
    int CODE_1200136 = 1200136;
    /**
     * 租户信息有误
     */
    int CODE_1200137 = 1200137;

    /**
     * 有预约的产品不能删除
     */
    int CODE_1200138 = 1200138;
    /**
     * 有保单的产品不能删除
     */
    int CODE_1200139 = 1200139;
    /**
     * 打款日期不能晚于当前日期
     */
    int CODE_1200140 = 1200140;
    /**
     * 无权限操作
     */
    int CODE_1200141 = 1200141;
    /**
     * 操作失败，该客户不属于您所有
     */
    int CODE_1200142 = 1200142;
    /**
     * 当前预约不是自己的预约不能重新提交
     */
    int CODE_1200143 = 1200143;

    /**
     * 请选择募集形式
     */
    int CODE_1200144 = 1200144;

    /**
     * 只有募集中的产品才能添加报单
     */
    int CODE_1200145 = 1200145;

    /**
     * 该产品可以直接报单，不需要预约
     */
    int CODE_1200146 = 1200146;

    /**
     * 该产品直接报单，请选择客户
     */
    int CODE_1200147 = 1200147;

    /**
     * 退款id不能为空
     */
    int CODE_1200148 = 1200148;

    /**
     * 该报单已退款
     */
    int CODE_1200149 = 1200149;

    /**
     * 该报单退款审批中
     */
    int CODE_1200150 = 1200150;

    /**
     * 退款数据不存在
     */
    int CODE_1200151 = 1200151;

    /**
     * 驳回中的退款才能重新提交
     */
    int CODE_1200152 = 1200152;

    /**
     * 发起人才能重新提交退款
     */
    int CODE_1200153 = 1200153;


    /**
     * 发起人才能取消申请退款
     */
    int CODE_1200154 = 1200154;

    /**
     * 驳回或者审批中的退款才能取消
     */
    int CODE_1200155 = 1200155;

    /**
     * 审批中的退款才能审批
     */
    int CODE_1200156 = 1200156;

    /**
     * 审批操作有误
     */
    int CODE_1200157 = 1200157;

    /**
     * 未上线和上线准备中的产品不能补入报单
     */
    int CODE_1200158 = 1200158;

    /**
     * 平台id不能为空
     */
    int CODE_1200159 = 1200159;

    /**
     * 请选择推荐位
     */
    int CODE_1200160 = 1200160;

    /**
     * 请选择状态
     */
    int CODE_1200161 = 1200161;

    /**
     * 平台不存在
     */
    int CODE_1200162 = 1200162;

    /**
     * 产品推荐配置不存在
     */
    int CODE_1200163 = 1200163;


    /**
     * 该推荐位已经配置了这个产
     */
    int CODE_1200164 = 1200164;

    /**
     * 位置是不存在
     */
    int CODE_1200165 = 1200165;

    /**
     * 平台code不能为空
     */
    int CODE_1200166 = 1200166;

    /**
     * 位置code不能为空
     */
    int CODE_1200167 = 1200167;

    /**
     * 取消原因不能为空
     */
    int CODE_1200168 = 1200168;
  
}
