package com.yundao.tenant.constant.code;

/**
 * jan
 *
 * @author jan
 * @create 2017-10-31 20:20
 **/
public interface Code1220000 {

    /**
     * 请输入领取限制数
     */
    int CODE_1220145 = 1220145;

    /**
     * 请选择“是否限制”值
     */
    int CODE_1220146 = 1220146;

    /**
     * 备注不能为空
     */
    int CODE_1220147 = 1220147;

    /**
     * 备注字数不能超过100
     */
    int CODE_1220148 = 1220148;

    /**
     * 请选择跟进方式
     */
    int CODE_1220149 = 1220149;

    /**
     * 仅限客户归属人可录入跟进记录
     */
    int CODE_1220150 = 1220150;

    /**
     * 财富管理-产品管理中存在和该基金同名的产品，请修改基金名称或重名的产品名称后再操作
     */
    int CODE_1220151 = 1220151;

    /**
     * 无法新增用户，可开通账户数已达上限
     */
    int CODE_1220152=1220152;

    /**
     * 公告数据不存在
     */
    int CODE_1220153=1220153;

    /**
     * 无法启用用户，可开通账户数已达上限
     */
    int CODE_1220154=1220154;

}
