package com.yundao.tenant.constant.code;

/**
 * ouyangli
 *
 * @author jan
 * @create 2017-10-31 20:24
 **/
public interface Code1230000 {
	/**
	 * 未发现手机号码
	 */
	int CODE_1230001 = 1230001;
	/**
	 * 手机号码已有客户使用
	 */
	int CODE_1230002 = 1230002;
	/**
	 * 手机号码错误
	 */
	int CODE_1230003 = 1230003;
	/**
	 * 姓名为空
	 */
	int CODE_1230004 = 1230004;
	/**
	 * 附件可见性不能为空
	 */
	int CODE_1230005 = 1230005;
	/**
	 * 帐号不存在
	 */
	int CODE_1230006 = 1230006;
	/**
	 * 邮件长度必须在1到40之间
	 */
	int CODE_1230007 = 1230007;
	/**
	 * 地址长度必须在1到20之间
	 */
	int CODE_1230008 = 1230008;
	/**
	 * 名片简介长度必须在1到30之间
	 */
	int CODE_1230009 = 1230009;
	/**
	 * 名片头衔长度必须在1到10之间
	 */
	int CODE_1230010 = 1230010;
	/**
     * 驳回中的退款数据不存在
     */
    int CODE_1230011 = 1230011;

}
