package com.yundao.tenant.constant.code;

/**
 * 提示码
 *
 * @author gjl
 * @create 2017-06-22 PM3:44
 **/
public interface GJLCodeConstant {

    /**
     * 业务对象有误
     */
    int CODE_1210000 = 1210000;

    int CODE_1210001 = 1210001;

    /**
     * 类型下有产品，不能进行删除
     */
    int CODE_1210002 = 1210002;
    /**
     * 产品公告有误
     */
    int CODE_1210003 = 1210003;
    /**
     * 产品公告状态有误
     */
    int CODE_1210004 = 1210004;
    /**
     * 下一步流转状态有误
     */
    int CODE_1210005 = 1210005;
    /**
     * 驳回原因不能为空
     */
    int CODE_1210006 = 1210006;
    /**
     * 编码长度必须在{min}到{max}之间
     */
    int CODE_1210007 = 1210007;
    /**
     * 是否公用只能是数字
     */
    int CODE_1210008 = 1210008;
    /**
     * 产品ID不能为空
     */
    int CODE_1210009 = 1210009;
    /**
     * 标题必须在{min}到{max}之间
     */
    int CODE_1210010 = 1210010;
    /**
     * 内容必须在{min}到{max}之间
     */
    int CODE_1210011 = 1210011;
    /**
     * 公告类型不能为空
     */
    int CODE_1210012 = 1210012;
    /**
     * 是否定时发送不允许为空
     */
    int CODE_1210013 = 1210013;
    /**
     * 定时发送时，定时发送时间不允许为空
     */
    int CODE_1210014 = 1210014;
    /**
     * 公告附件不能超过5个文件
     */
    int CODE_1210015 = 1210015;
    /**
     * 公告类别下有对应的公告，不允许删除
     */
    int CODE_1210016 = 1210016;
    /**
     * 没有找到对应的产品公告
     */
    int CODE_1210017 = 1210017;
    /**
     * 是否启用不能为空
     */
    int CODE_1210018 = 1210018;
    /**
     * 客户不允许为空
     */
    int CODE_1210019 = 1210019;
    /**
     * 日期不允许为空
     */
    int CODE_1210020 = 1210020;
    /**
     * 备注的长度不允许超过{max}
     */
    int CODE_1210021 = 1210021;
    /**
     * 不存在当前客户，请确认客户ID是否有误
     */
    int CODE_1210022 = 1210022;
    /**
     * 银行卡账号必须在{min}到{max}之间
     */
    int CODE_1210023 = 1210023;
    /**
     * 开户行必须在{min}到{max}之间
     */
    int CODE_1210024 = 1210024;
    /**
     * 银行卡正面不能为空
     */
    int CODE_1210025 = 1210025;
    /**
     * 银行卡反面不能为空
     */
    int CODE_1210026 = 1210026;
    /**
     * 没有找到该产品
     */
    int CODE_1210027 = 1210027;
    /**
     * 公告类型有误
     */
    int CODE_1210028 = 1210028;
    /**
     * 公告状态只有未申请审核和驳回才允许修改公告
     */
    int CODE_1210029 = 1210029;
    /**
     * 发送时间必须大于当前时间
     */
    int CODE_1210030 = 1210030;
    /**
     * 没有找到该公告
     */
    int CODE_1210031 = 1210031;
    /**
     * 没有找到该公告ID
     */
    int CODE_1210032 = 1210032;
    /**
     * 客户名称必须在{min}到{max}之间
     */
    int CODE_1210033 = 1210033;
    /**
     * 请为客户上传资产证明，并确认客户符合专业投资人标准后再选择该选项
     */
    int CODE_1210034 = 1210034;
    /**
     * 微信必须在{min}到{max}之间
     */
    int CODE_1210035 = 1210035;
    /**
     * QQ最大长度不能大于{max}
     */
    int CODE_1210036 = 1210036;
    /**
     * QQ必须是全数字
     */
    int CODE_1210037 = 1210037;
    /**
     * 地址最大长度不能大于{max}
     */
    int CODE_1210038 = 1210038;
    /**
     * 行业最大长度不能大于{max}
     */
    int CODE_1210039 = 1210039;
    /**
     * 机构最大长度不能大于{max}
     */
    int CODE_1210040 = 1210040;
    /**
     * 职位长度不能大于{max}
     */
    int CODE_1210041 = 1210041;
    /**
     * 标签长度过长
     */
    int CODE_1210042 = 1210042;
    /**
     * 手机号已经存在
     */
    int CODE_1210043 = 1210043;
    /**
     * 投资偏好不正确，请重新选择
     */
    int CODE_1210044 = 1210044;
    /**
     * 跟进方式不允许为空
     */
    int CODE_1210045 = 1210045;
    /**
     * 跟进状态不允许为空
     */
    int CODE_1210046 = 1210046;
    /**
     * 跟进内容必须在{min}到{max}之间
     */
    int CODE_1210047 = 1210047;
    /**
     * 手机号格式有误
     */
    int CODE_1210048 = 1210048;
    /**
     * 新增客户类型不允许为空
     */
    int CODE_1210049 = 1210049;
    /**
     * 消息类型有误，请确认消息类型
     */
    int CODE_1210050 = 1210050;
     /**
     * 参数{name}不允许为空！
     */
    int CODE_1210051 = 1210051;
    /**
     * 消息对应为配置消息类型。
     */
    int CODE_1210052 = 1210052;
    /**
     * 不支持的消息发送类型
     */
    int CODE_1210053 = 1210053;
    /**
     * 消息类型不能为空
     */
    int CODE_1210054 = 1210054;
    /**
     * 您不是该客户的理财师不允许为该客户添加跟进
     */
    int CODE_1210055 = 1210055;
    /**
     * 下次跟进时间要晚于当前时间
     */
    int CODE_1210056 = 1210056;
    /**
     * 客户不存在
     */
    int CODE_1210057 = 1210057;
    /**
     * 客户标签录入数量上限不能超过30个
     */
    int CODE_1210058 = 1210058;
    /**
     * 请选择报单预约
     */
    int CODE_1210059 = 1210059;
    /**
     * 请选择打款日期
     */
    int CODE_1210060 = 1210060;
    /**
     * 金额必须是数字，长度必须在1-8之间，不支持小数点
     */
    int CODE_1210061 = 1210061;
    /**
     * 请选择正确的预约
     */
    int CODE_1210062 = 1210062;
    /**
     * 同一个预约仅能报一次单
     */
    int CODE_1210063 = 1210063;
    /**
     * 当前预约不是自己的预约不能进行报单
     */
    int CODE_1210064 = 1210064;
    /**
     * 当前保单不是你的保单不能进行查看
     */
    int CODE_1210065 = 1210065;
    /**
     * 报单有误，请确认报单ID
     */
    int CODE_1210066 = 1210066;
    /**
     * 资产证明附件不能超过4个
     */
    int CODE_1210067 = 1210067;
    /**
     * 取消的报单不允许修改
     */
    int CODE_1210068 = 1210068;
    /**
     * 合规双录文件只允许一个
     */
    int CODE_1210069 = 1210069;
    /**
     * 投资者基本信息表（自然人）文件只允许一个
     */
    int CODE_1210070 = 1210070;
    /**
     * 投资者风险匹配告知书及投资者确认函只允许一个
     */
    int CODE_1210071 = 1210071;
    /**
     * 风险承受能力调查问卷（自然人）只允许四个
     */
    int CODE_1210072 = 1210072;
    /**
     * 风基金回访确认书只允许一个
     */
    int CODE_1210073 = 1210073;
    /**
     * 其他合规文件只允许八个
     */
    int CODE_1210074 = 1210074;
    /**
     * 该产品公告不允许删除
     */
    int CODE_1210075 = 1210075;
    /**
     * 已通过的报单不允许修改{name}
     */
    int CODE_1210076 = 1210076;
    /**
     * 银行帐号只能是数字
     */
    int CODE_1210077 = 1210077;
    /**
     * 预约必须通过才能进行报单
     */
    int CODE_1210078 = 1210078;
    /**
     * 手机号不存在
     */
    int CODE_1210079 = 1210079;
    /**
     * 验证码有误
     */
    int CODE_1210080 = 1210080;
    /**
     * 密码有误
     */
    int CODE_1210081 = 1210081;
    /**
     * 报单ID不能为空
     */
    int CODE_1210082 = 1210082;
    /**
     * 应用类型不能为空（pc或app）
     */
    int CODE_1210083 = 1210083;
    /**
     * 凭证已过期
     */
    int CODE_1210084 = 1210084;
    /**
     * 用户已经存在
     */
    int CODE_1210085 = 1210085;
    /**
     * 没有找到ticket信息
     */
    int CODE_1210086 = 1210086;
    /**
     * 手机号码已经存在
     */
    int CODE_1210087 = 1210087;
    /**
     * 还未配置产品审核员
     */
    int CODE_1210088 = 1210088;
    /**
     * 微信必须在6到20之间
     */
    int CODE_1210089 = 1210089;
    /**
     * 公告类型名称不能相同
     */
    int CODE_1210090 = 1210090;
    /**
     * 佣金类型不能为空
     */
    int CODE_1210091 = 1210091;
    /**
     * 佣金费率不能为空
     */
    int CODE_1210092 = 1210092;
    /**
     * 佣金金额不能为空
     */
    int CODE_1210093 = 1210093;
    /**
     * 发放时间不能为空
     */
    int CODE_1210094 = 1210094;
    /**
     * 报单审核未通过不允许进行结佣
     */
    int CODE_1210095 = 1210095;
    /**
     * 结佣范围不能为空
     */
    int CODE_1210096 = 1210096;
    /**
     * 结佣范围有误，请确认
     */
    int CODE_1210097 = 1210097;
    /**
     * 业务ID不能为空
     */
    int CODE_1210098 = 1210098;
    /**
     * 结佣数据有误
     */
    int CODE_1210099 = 1210099;
    /**
     * 只有状态为待审核才能进行审核
     */
    int CODE_1210100 = 1210100;
    /**
     * 原因不允许为空
     */
    int CODE_1210101 = 1210101;
    /**
     * 平台ID不能为空
     */
    int CODE_1210102 = 1210102;
    /**
     * 名称必须在{min}到{max}之间
     */
    int CODE_1210103 = 1210103;
    /**
     * 栏目url必须在{min}到{max}之间
     */
    int CODE_1210104 = 1210104;
    /**
     * 图片必须在{min}到{max}之间
     */
    int CODE_1210105 = 1210105;
    /**
     * 排序不能为空
     */
    int CODE_1210106 = 1210106;
    /**
     * 状态不能为空
     */
    int CODE_1210107 = 1210107;
    /**
     * 栏目名称必须唯一
     */
    int CODE_1210108 = 1210108;
    /**
     * 栏目url必须唯一
     */
    int CODE_1210109 = 1210109;
    /**
     * 平台不正确，请确认
     */
    int CODE_1210110 = 1210110;
    /**
     * seo title不能超过{max}位
     */
    int CODE_1210111 = 1210111;
    /**
     * seo关键字不能超过{max}位
     */
    int CODE_1210112 = 1210112;
    /**
     * seo描述不能超过{max}位
     */
    int CODE_1210113 = 1210113;
    /**
     * 文章有误。请稍后重试
     */
    int CODE_1210114 = 1210114;
    /**
     * 文章url不能重复
     */
    int CODE_1210115 = 1210115;
    /**
     * 文章导读不允许为空，并且不能超过{max}
     */
    int CODE_1210116 = 1210116;
    /**
     * 作者名称不能超过{max}字符
     */
    int CODE_1210117 = 1210117;
    /**
     * 文章来源不能超过{max}字符
     */
    int CODE_1210118 = 1210118;
    /**
     * 文章内容不能为空
     */
    int CODE_1210119 = 1210119;
    /**
     * 文章标题不能为空，并且不能超过{max}字符
     */
    int CODE_1210120 = 1210120;
    /**
     * 发布时间不能为空
     */
    int CODE_1210121 = 1210121;
    /**
     * 文章启用，发布时间不能为空!
     */
    int CODE_1210122 = 1210122;
    /**
     * 栏目不存在
     */
    int CODE_1210123 = 1210123;
    /**
     * 报单状态不为未提交，不允许提交申请
     */
    int CODE_1210124 = 1210124;
    /**
     * 当前报单人不是本人不能进行提交报单
     */
    int CODE_1210125 = 1210125;
    /**
     * 请填写客户证件
     */
    int CODE_1210126 = 1210126;
    /**
     * 客户证件有误
     */
    int CODE_1210127 = 1210127;
    /**
     * 发放时间不能晚于当前
     */
    int CODE_1210128 = 1210128;
    /**
     * 佣金金额必须大于0
     */
    int CODE_1210129 = 1210129;
    /**
     * 佣金费率必须大于0
     */
    int CODE_1210130 = 1210130;
    /**
     * 该产品募集结束状态，不可预约
     */
    int CODE_1210131 = 1210131;
    /**
     * 改产品还未提交审批，没有审批记录
     */
    int CODE_1210132 = 1210132;
}
